{
    "fact_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has inaccuracies in terms of factual accuracy. Factual accuracy means the summary does not include information not present in the original text, correctly judges the polarity of the aspects mentioned in the text, and correctly categorizes strengths and weaknesses. Please improve the summary to ensure factual accuracy. \n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "compre_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has errors in terms of comprehensiveness. Comprehensiveness means the summary does not miss any aspects mentioned in the original text and ensures coverage of both strengths and weaknesses. Please improve the summary to ensure comprehensiveness.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "relate_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has errors in terms of content relevance. Content relevance means the summary only includes information related to {name} and does not include unrelated information. Please improve the summary to ensure content relevance.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "fact_compre_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has errors in both factual accuracy and comprehensiveness. Factual accuracy means the summary does not include information not present in the original text, correctly judges the polarity of the aspects mentioned in the text, and correctly categorizes strengths and weaknesses. Comprehensiveness means the summary does not miss any aspects mentioned in the original text and ensures coverage of both strengths and weaknesses. Please improve the summary to ensure both factual accuracy and comprehensiveness.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "compre_relate_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has errors in both comprehensiveness and content relevance. Comprehensiveness means the summary does not miss any aspects mentioned in the original text and ensures coverage of both strengths and weaknesses. Content relevance means the summary only includes information related to {name} and does not include unrelated information. Please improve the summary to ensure both comprehensiveness and content relevance.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "relate_fact_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has errors in both content relevance and factual accuracy. Content relevance means the summary only includes information related to {name} and does not include unrelated information. Factual accuracy means the summary does not include information not present in the original text, correctly judges the polarity of the aspects mentioned in the text, and correctly categorizes strengths and weaknesses. Please improve the summary to ensure both content relevance and factual accuracy.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "tri_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary has errors in factual accuracy, comprehensiveness, and content relevance. Factual accuracy means the summary does not include information not present in the original text, correctly judges the polarity of the aspects mentioned in the text, and correctly categorizes strengths and weaknesses. Comprehensiveness means the summary does not miss any aspects mentioned in the original text and ensures coverage of both strengths and weaknesses. Content relevance means the summary only includes information related to {name} and does not include unrelated information. Please improve the summary to ensure factual accuracy, comprehensiveness, and content relevance.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:",
    
    "empty_template": "The input contains text about {name} and a summary of the strengths and weaknesses of {name} based on this text. The summary may have errors in factual accuracy, comprehensiveness, and content relevance, or it may be correct. Factual accuracy means the summary does not include information not present in the original text, correctly judges the polarity of the aspects mentioned in the text, and correctly categorizes strengths and weaknesses. Comprehensiveness means the summary does not miss any aspects mentioned in the original text and ensures coverage of both strengths and weaknesses. Content relevance means the summary only includes information related to {name} and does not include unrelated information. Please improve the summary based on the above criteria and output the revised summary.\n## Input\nText: {text}\nSummary: {summary}\n## Output\nRevised Summary:"
}
